perf-reports/after/csv-export.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /home/ubuntu/repos/timesheet-app/k6/csv-export.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m10s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 40s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/50 VUs, 129 complete and 0 interrupted iterations
default   [   2% ] 01/50 VUs  01.0s/40.0s

running (0m02.0s), 02/50 VUs, 295 complete and 0 interrupted iterations
default   [   5% ] 02/50 VUs  02.0s/40.0s

running (0m03.0s), 03/50 VUs, 454 complete and 0 interrupted iterations
default   [   7% ] 03/50 VUs  03.0s/40.0s

running (0m04.0s), 04/50 VUs, 577 complete and 0 interrupted iterations
default   [  10% ] 04/50 VUs  04.0s/40.0s

running (0m05.0s), 05/50 VUs, 698 complete and 0 interrupted iterations
default   [  12% ] 05/50 VUs  05.0s/40.0s

running (0m06.0s), 06/50 VUs, 814 complete and 0 interrupted iterations
default   [  15% ] 06/50 VUs  06.0s/40.0s

running (0m07.0s), 07/50 VUs, 937 complete and 0 interrupted iterations
default   [  17% ] 07/50 VUs  07.0s/40.0s

running (0m08.0s), 08/50 VUs, 1058 complete and 0 interrupted iterations
default   [  20% ] 08/50 VUs  08.0s/40.0s

running (0m09.0s), 09/50 VUs, 1182 complete and 0 interrupted iterations
default   [  22% ] 09/50 VUs  09.0s/40.0s

running (0m10.0s), 09/50 VUs, 1300 complete and 0 interrupted iterations
default   [  25% ] 09/50 VUs  10.0s/40.0s

running (0m11.0s), 11/50 VUs, 1421 complete and 0 interrupted iterations
default   [  27% ] 11/50 VUs  11.0s/40.0s

running (0m12.0s), 13/50 VUs, 1529 complete and 0 interrupted iterations
default   [  30% ] 13/50 VUs  12.0s/40.0s

running (0m13.0s), 15/50 VUs, 1648 complete and 0 interrupted iterations
default   [  32% ] 15/50 VUs  13.0s/40.0s

running (0m14.0s), 17/50 VUs, 1763 complete and 0 interrupted iterations
default   [  35% ] 17/50 VUs  14.0s/40.0s

running (0m15.0s), 19/50 VUs, 1877 complete and 0 interrupted iterations
default   [  37% ] 19/50 VUs  15.0s/40.0s

running (0m16.0s), 21/50 VUs, 1994 complete and 0 interrupted iterations
default   [  40% ] 21/50 VUs  16.0s/40.0s

running (0m17.0s), 23/50 VUs, 2113 complete and 0 interrupted iterations
default   [  42% ] 23/50 VUs  17.0s/40.0s

running (0m18.0s), 25/50 VUs, 2222 complete and 0 interrupted iterations
default   [  45% ] 25/50 VUs  18.0s/40.0s

running (0m19.0s), 27/50 VUs, 2335 complete and 0 interrupted iterations
default   [  47% ] 27/50 VUs  19.0s/40.0s

running (0m20.0s), 29/50 VUs, 2453 complete and 0 interrupted iterations
default   [  50% ] 29/50 VUs  20.0s/40.0s

running (0m21.0s), 31/50 VUs, 2566 complete and 0 interrupted iterations
default   [  52% ] 31/50 VUs  21.0s/40.0s

running (0m22.0s), 33/50 VUs, 2684 complete and 0 interrupted iterations
default   [  55% ] 33/50 VUs  22.0s/40.0s

running (0m23.0s), 35/50 VUs, 2798 complete and 0 interrupted iterations
default   [  57% ] 35/50 VUs  23.0s/40.0s

running (0m24.0s), 37/50 VUs, 2910 complete and 0 interrupted iterations
default   [  60% ] 37/50 VUs  24.0s/40.0s

running (0m25.0s), 39/50 VUs, 3030 complete and 0 interrupted iterations
default   [  62% ] 39/50 VUs  25.0s/40.0s

running (0m26.0s), 41/50 VUs, 3150 complete and 0 interrupted iterations
default   [  65% ] 41/50 VUs  26.0s/40.0s

running (0m27.0s), 43/50 VUs, 3262 complete and 0 interrupted iterations
default   [  67% ] 43/50 VUs  27.0s/40.0s

running (0m28.0s), 45/50 VUs, 3375 complete and 0 interrupted iterations
default   [  70% ] 45/50 VUs  28.0s/40.0s

running (0m29.0s), 47/50 VUs, 3507 complete and 0 interrupted iterations
default   [  72% ] 47/50 VUs  29.0s/40.0s

running (0m30.0s), 49/50 VUs, 3605 complete and 0 interrupted iterations
default   [  75% ] 49/50 VUs  30.0s/40.0s

running (0m31.0s), 47/50 VUs, 3729 complete and 0 interrupted iterations
default   [  77% ] 47/50 VUs  31.0s/40.0s

running (0m32.0s), 41/50 VUs, 3838 complete and 0 interrupted iterations
default   [  80% ] 41/50 VUs  32.0s/40.0s

running (0m33.0s), 37/50 VUs, 3957 complete and 0 interrupted iterations
default   [  82% ] 37/50 VUs  33.0s/40.0s

running (0m34.0s), 32/50 VUs, 4081 complete and 0 interrupted iterations
default   [  85% ] 32/50 VUs  34.0s/40.0s

running (0m35.0s), 26/50 VUs, 4195 complete and 0 interrupted iterations
default   [  87% ] 26/50 VUs  35.0s/40.0s

running (0m36.0s), 21/50 VUs, 4318 complete and 0 interrupted iterations
default   [  90% ] 21/50 VUs  36.0s/40.0s

running (0m37.0s), 16/50 VUs, 4434 complete and 0 interrupted iterations
default   [  92% ] 16/50 VUs  37.0s/40.0s

running (0m38.0s), 11/50 VUs, 4554 complete and 0 interrupted iterations
default   [  95% ] 11/50 VUs  38.0s/40.0s

running (0m39.0s), 06/50 VUs, 4678 complete and 0 interrupted iterations
default   [  97% ] 06/50 VUs  39.0s/40.0s

running (0m40.0s), 01/50 VUs, 4816 complete and 0 interrupted iterations
default   [ 100% ] 01/50 VUs  40.0s/40.0s

     ✓ status 200
     ✓ is csv
     ✓ has header row

     checks.........................: 100.00% 14451 out of 14451
     data_received..................: 62 MB   1.5 MB/s
     data_sent......................: 766 kB  19 kB/s
     http_req_blocked...............: avg=3.97µs   min=651ns    med=2.15µs   max=447.26µs p(90)=2.78µs   p(95)=3.2µs    p(99)=117.69µs
     http_req_connecting............: avg=1.2µs    min=0s       med=0s       max=355.87µs p(90)=0s       p(95)=0s       p(99)=78.59µs 
   ✓ http_req_duration..............: avg=186.68ms min=6.08ms   med=174.22ms max=583.76ms p(90)=380.81ms p(95)=407.86ms p(99)=432.04ms
       { expected_response:true }...: avg=186.68ms min=6.08ms   med=174.22ms max=583.76ms p(90)=380.81ms p(95)=407.86ms p(99)=432.04ms
   ✓ http_req_failed................: 0.00%   0 out of 4817
     http_req_receiving.............: avg=56.66ms  min=1.47ms   med=47.05ms  max=232.64ms p(90)=114.71ms p(95)=136.77ms p(99)=189.82ms
     http_req_sending...............: avg=8.81µs   min=2.52µs   med=7.77µs   max=598.13µs p(90)=10.21µs  p(95)=12.42µs  p(99)=33.39µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=130.01ms min=778.93µs med=110.92ms max=411.76ms p(90)=283.33ms p(95)=354.08ms p(99)=390.82ms
     http_reqs......................: 4817    120.418062/s
     iteration_duration.............: avg=186.87ms min=6.25ms   med=174.4ms  max=583.92ms p(90)=380.98ms p(95)=408.03ms p(99)=432.18ms
     iterations.....................: 4817    120.418062/s
     payload_bytes..................: avg=170306   min=170306   med=170306   max=170306   p(90)=170306   p(95)=170306   p(99)=170306  
     vus............................: 1       min=1              max=49
     vus_max........................: 50      min=50             max=50


running (0m40.0s), 00/50 VUs, 4817 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  40s