perf-reports/after/dashboard-load.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /home/ubuntu/repos/timesheet-app/k6/dashboard-load.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m10s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 40s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/50 VUs, 36 complete and 0 interrupted iterations
default   [   2% ] 01/50 VUs  01.0s/40.0s

running (0m02.0s), 02/50 VUs, 75 complete and 0 interrupted iterations
default   [   5% ] 02/50 VUs  02.0s/40.0s

running (0m03.0s), 03/50 VUs, 113 complete and 0 interrupted iterations
default   [   7% ] 03/50 VUs  03.0s/40.0s

running (0m04.0s), 04/50 VUs, 149 complete and 0 interrupted iterations
default   [  10% ] 04/50 VUs  04.0s/40.0s

running (0m05.0s), 05/50 VUs, 189 complete and 0 interrupted iterations
default   [  12% ] 05/50 VUs  05.0s/40.0s

running (0m06.0s), 06/50 VUs, 227 complete and 0 interrupted iterations
default   [  15% ] 06/50 VUs  06.0s/40.0s

running (0m07.0s), 07/50 VUs, 268 complete and 0 interrupted iterations
default   [  17% ] 07/50 VUs  07.0s/40.0s

running (0m08.0s), 08/50 VUs, 311 complete and 0 interrupted iterations
default   [  20% ] 08/50 VUs  08.0s/40.0s

running (0m09.0s), 09/50 VUs, 351 complete and 0 interrupted iterations
default   [  22% ] 09/50 VUs  09.0s/40.0s

running (0m10.0s), 09/50 VUs, 390 complete and 0 interrupted iterations
default   [  25% ] 09/50 VUs  10.0s/40.0s

running (0m11.0s), 11/50 VUs, 430 complete and 0 interrupted iterations
default   [  27% ] 11/50 VUs  11.0s/40.0s

running (0m12.0s), 13/50 VUs, 468 complete and 0 interrupted iterations
default   [  30% ] 13/50 VUs  12.0s/40.0s

running (0m13.0s), 15/50 VUs, 510 complete and 0 interrupted iterations
default   [  32% ] 15/50 VUs  13.0s/40.0s

running (0m14.0s), 17/50 VUs, 553 complete and 0 interrupted iterations
default   [  35% ] 17/50 VUs  14.0s/40.0s

running (0m15.0s), 19/50 VUs, 589 complete and 0 interrupted iterations
default   [  37% ] 19/50 VUs  15.0s/40.0s

running (0m16.0s), 21/50 VUs, 630 complete and 0 interrupted iterations
default   [  40% ] 21/50 VUs  16.0s/40.0s

running (0m17.0s), 23/50 VUs, 673 complete and 0 interrupted iterations
default   [  42% ] 23/50 VUs  17.0s/40.0s

running (0m18.0s), 25/50 VUs, 707 complete and 0 interrupted iterations
default   [  45% ] 25/50 VUs  18.0s/40.0s

running (0m19.0s), 27/50 VUs, 747 complete and 0 interrupted iterations
default   [  47% ] 27/50 VUs  19.0s/40.0s

running (0m20.0s), 29/50 VUs, 799 complete and 0 interrupted iterations
default   [  50% ] 29/50 VUs  20.0s/40.0s

running (0m21.0s), 31/50 VUs, 832 complete and 0 interrupted iterations
default   [  52% ] 31/50 VUs  21.0s/40.0s

running (0m22.0s), 33/50 VUs, 864 complete and 0 interrupted iterations
default   [  55% ] 33/50 VUs  22.0s/40.0s

running (0m23.0s), 35/50 VUs, 913 complete and 0 interrupted iterations
default   [  57% ] 35/50 VUs  23.0s/40.0s

running (0m24.0s), 37/50 VUs, 965 complete and 0 interrupted iterations
default   [  60% ] 37/50 VUs  24.0s/40.0s

running (0m25.0s), 39/50 VUs, 1003 complete and 0 interrupted iterations
default   [  62% ] 39/50 VUs  25.0s/40.0s

running (0m26.0s), 41/50 VUs, 1042 complete and 0 interrupted iterations
default   [  65% ] 41/50 VUs  26.0s/40.0s

running (0m27.0s), 43/50 VUs, 1077 complete and 0 interrupted iterations
default   [  67% ] 43/50 VUs  27.0s/40.0s

running (0m28.0s), 45/50 VUs, 1126 complete and 0 interrupted iterations
default   [  70% ] 45/50 VUs  28.0s/40.0s

running (0m29.0s), 47/50 VUs, 1158 complete and 0 interrupted iterations
default   [  72% ] 47/50 VUs  29.0s/40.0s

running (0m30.0s), 49/50 VUs, 1200 complete and 0 interrupted iterations
default   [  75% ] 49/50 VUs  30.0s/40.0s

running (0m31.0s), 49/50 VUs, 1226 complete and 0 interrupted iterations
default   [  77% ] 49/50 VUs  31.0s/40.0s

running (0m32.0s), 44/50 VUs, 1275 complete and 0 interrupted iterations
default   [  80% ] 44/50 VUs  32.0s/40.0s

running (0m33.0s), 39/50 VUs, 1319 complete and 0 interrupted iterations
default   [  82% ] 39/50 VUs  33.0s/40.0s

running (0m34.0s), 33/50 VUs, 1358 complete and 0 interrupted iterations
default   [  85% ] 33/50 VUs  34.0s/40.0s

running (0m35.0s), 27/50 VUs, 1421 complete and 0 interrupted iterations
default   [  87% ] 27/50 VUs  35.0s/40.0s

running (0m36.0s), 21/50 VUs, 1458 complete and 0 interrupted iterations
default   [  90% ] 21/50 VUs  36.0s/40.0s

running (0m37.0s), 16/50 VUs, 1510 complete and 0 interrupted iterations
default   [  92% ] 16/50 VUs  37.0s/40.0s

running (0m38.0s), 11/50 VUs, 1552 complete and 0 interrupted iterations
default   [  95% ] 11/50 VUs  38.0s/40.0s

running (0m39.0s), 06/50 VUs, 1589 complete and 0 interrupted iterations
default   [  97% ] 06/50 VUs  39.0s/40.0s

running (0m40.0s), 01/50 VUs, 1635 complete and 0 interrupted iterations
default   [ 100% ] 01/50 VUs  40.0s/40.0s

     ✓ status 200
     ✓ has totals

     checks.........................: 100.00% 3272 out of 3272
     data_received..................: 2.5 MB  62 kB/s
     data_sent......................: 252 kB  6.3 kB/s
     http_req_blocked...............: avg=7.32µs   min=595ns   med=2.15µs   max=398.33µs p(90)=3.04µs  p(95)=3.83µs   p(99)=166.52µs
     http_req_connecting............: avg=3.63µs   min=0s      med=0s       max=341.8µs  p(90)=0s      p(95)=0s       p(99)=114.73µs
   ✓ http_req_duration..............: avg=557.28ms min=24.58ms med=526ms    max=1.46s    p(90)=1.09s   p(95)=1.16s    p(99)=1.22s   
       { expected_response:true }...: avg=557.28ms min=24.58ms med=526ms    max=1.46s    p(90)=1.09s   p(95)=1.16s    p(99)=1.22s   
   ✓ http_req_failed................: 0.00%   0 out of 1636
     http_req_receiving.............: avg=39.16ms  min=47.71µs med=18.81ms  max=352.45ms p(90)=95.86ms p(95)=155.42ms p(99)=289.78ms
     http_req_sending...............: avg=9.09µs   min=2.54µs  med=7.91µs   max=111.37µs p(90)=11.18µs p(95)=17µs     p(99)=44.68µs 
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s      p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=518.1ms  min=24.4ms  med=490.59ms max=1.41s    p(90)=1.01s   p(95)=1.08s    p(99)=1.14s   
     http_reqs......................: 1636    40.882002/s
     iteration_duration.............: avg=557.37ms min=24.67ms med=526.1ms  max=1.46s    p(90)=1.09s   p(95)=1.16s    p(99)=1.22s   
     iterations.....................: 1636    40.882002/s
     payload_bytes..................: avg=1154     min=1154    med=1154     max=1154     p(90)=1154    p(95)=1154     p(99)=1154    
     vus............................: 1       min=1            max=49
     vus_max........................: 50      min=50           max=50


running (0m40.0s), 00/50 VUs, 1636 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  40s